const int len = 11;
byte numberSegments[len] = {
  0b00111111, 0b00000110, 0b01011011, 0b01001111, 0b01100110, // 0,1,2,3,4
  0b01101101, 0b01111101, 0b00000111, 0b01111111, 0b01101111, // 5,6,7,8,9
  0b10000000                                                  // крапка
};

void setup() {
  DDRD = B11111111; // піни портів D (на платі 0-7 піни) і
  DDRB = B111111; // B (на платі 8-13 піни) позначаєм вихідними

  PORTB = B111111; // встановлюємо високий рівень пінів порта В (на платі 8-13 піни)
}

void loop() {
  for (int num = 0; num < 4; num++)
  {
    PORTB |= ~PORTB; // встановлюємо високий рівень на пінах 8-13 порта В
    PORTB &= ~(1 << num); // встановлюємо низький рівень піна порта В
    for (int i = 0; i < len; i++)
    {
      PORTD = numberSegments[i];
      delay(200);
    }
  }
}
