static byte num = 0;

void setup() {
  DDRD = B11111111; // піни портів D (на платі 0-7 піни) і
  DDRB = B111111; // B (на платі 8-13 піни) позначаєм вихідними

  PORTB = B111111; // встановлюємо високий рівень пінів порта В (на платі 8-13 піни)
}

void loop() {
  PORTB |= ~PORTB; //PORTB = B111111; // встановлюємо високий рівень на пінах 8-13 порта В 
  PORTB &= ~(1 << num); //PORTB = B111110; // встановлюємо низький рівень 8 піна порта В при num=0
  num++;
  num %= 4;
  
  PORTD = B00111111; // пишем "нуль" у порт D
  delay(200); // пауза півсекунди
  PORTD = B00000110; // пишем "одиницю" у порт D
  delay(200);
  PORTD = B01011011; // пишем "двійку" у порт D
  delay(200);
  PORTD = B01001111; // пишем "трійку" у порт D
  delay(200);
  PORTD = B01100110; // пишем "четвірку" у порт D
  delay(200);
  PORTD = B01101101; // пишем "п'ятірку" у порт D
  delay(200);
  PORTD = B01111101; // пишем "шестірку" у порт D
  delay(200);
  PORTD = B00000111; // пишем "семірку" у порт D
  delay(200);
  PORTD = B01111111; // пишем "вісімку" у порт D
  delay(200);
  PORTD = B01101111; // пишем "дев'ятку" у порт D
  delay(200);
  PORTD = B10000000; // пишем "крапка" у порт D
  delay(200);
}
